We got a weird situation where terraform detected changes made outside of Terraform and the changes included the deletion of the service key and changes in the exporter app:

```
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "*** apply":

  # module.incharge_environment_test.module.redis.cloudfoundry_app.exporter has been changed
  ~ resource "cloudfoundry_app" "exporter" {
      ~ environment          = (sensitive value)
        id                   = "08db1d89-6afd-40dd-a90a-de31f11452f6"
        name                 = "tf-redis-exporter-84ADF"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.incharge_environment_test.module.redis.cloudfoundry_service_key.key has been deleted
  - resource "cloudfoundry_service_key" "key" {
      - credentials      = {
          - "hostname" = "redis-1ccc5c29.svc-2.na1.cluster.hsdp.io"
          - "password" = "D1oKvG9KU800cY06UjvfCbAW"
          - "port"     = "6379"
        } -> null
      - id               = "ccbc70ac-c87f-4c36-9cee-1427d71e1ec1" -> null
      - name             = "key" -> null
      - service_instance = "1ccc5c29-cd01-42a2-9a0a-4f9dc9ee7d70" -> null
    }
 
```

From there, it detected that it needed to update the app and recreate the key:

```
  # module.incharge_environment_test.module.redis.cloudfoundry_app.exporter will be updated in-place
  ~ resource "cloudfoundry_app" "exporter" {
      ~ environment          = (sensitive value)
        id                   = "08db1d89-6afd-40dd-a90a-de31f11452f6"
      ~ id_bg                = "08db1d89-6afd-40dd-a90a-de31f11452f6" -> (known after apply)
        name                 = "tf-redis-exporter-84ADF"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.incharge_environment_test.module.redis.cloudfoundry_service_key.key will be created
  + resource "cloudfoundry_service_key" "key" {
      + credentials      = (known after apply)
      + id               = (known after apply)
      + name             = "key"
      + service_instance = "1ccc5c29-cd01-42a2-9a0a-4f9dc9ee7d70"
    }
```

It all happened after the CF user password had expired and we had to change to a new user. The execution above failed because the new user did not have permission to perform the actions it needed for this APPLY:

```
Error: You are not authorized to perform the requested action
```

So we gave the new user the correct permissions and tried again. Then, we got the following error:

```
Error: The service key name is taken: key

  with module.incharge_environment_test.module.redis.cloudfoundry_service_key.key,
  on .***/modules/incharge_environment_test.redis/main.tf line 18, in resource "cloudfoundry_service_key" "key":
  18: resource "cloudfoundry_service_key" "key" {
```

We checked on CF and the key was actually there, so the error made sense. So we forced it to be deleted, we commented the code where we instantiate the Redis module, but it failed with the following error:

```
Error: Please delete the service_bindings associations for your service_instances.
```

😟 